{
  "ir_version": 1,
  "format": "casir-json-1",
  "level": "EL",
  "meta": {"tool": "cascode-0.2.0", "when": "2025-10-09T00:00:00Z"},

  "nets": [
    {"id": "VDD",    "domain": "supply",    "rail": "VDD"},
    {"id": "GND",    "domain": "ground",    "rail": "GND"},
    {"id": "vinp",   "domain": "electrical"},
    {"id": "vinn",   "domain": "electrical"},
    {"id": "vout",   "domain": "electrical"},
    {"id": "Nt0",    "domain": "electrical"},
    {"id": "Nt1",    "domain": "electrical"},
    {"id": "Np1",    "domain": "electrical"},
    {"id": "Np2",    "domain": "electrical"},
    {"id": "NpBias", "domain": "electrical"},
    {"id": "Nn",     "domain": "electrical"},
    {"id": "vb1",    "domain": "bias"},
    {"id": "vb2",    "domain": "bias"},
    {"id": "vb3",    "domain": "bias"},
    {"id": "vb4",    "domain": "bias"},
    {"id": "vb5",    "domain": "bias"}
  ],

  "bundles": [
    {"id": "IN", "type": "Diff", "fields": {"p": "vinp", "n": "vinn"}}
  ],

  "motifs": [
    {
      "id": "ptail",
      "type": "TailCurrentSourcePMOS",
      "ports": {"out": "Nt0", "gate": "vb1", "vdd": "VDD"},
      "impl": {"char_ref": "lib.motifs/tail_pmos@1.0"}
    },
    {
      "id": "ptailcas",
      "type": "PMOSCascode",
      "ports": {"in": "Nt0", "out": "Nt1", "bias": "vb3", "vdd": "VDD"},
      "impl": {"char_ref": "lib.motifs/pmos_cascode@1.0"}
    },
    {
      "id": "dp",
      "type": "DiffPairPMOS",
      "traits": ["AmplifierStage"],
      "ports": {"in_p": "vinp", "in_n": "vinn", "tail": "Nt1", "vdd": "VDD"},
      "impl": {"char_ref": "lib.motifs/diff_pair_pmos@1.0"}
    },
    {
      "id": "p_d1",
      "type": "PMOSDiode",
      "ports": {"node": "Np1", "vdd": "VDD"},
      "impl": {"char_ref": "lib.motifs/pmos_diode@1.0"}
    },
    {
      "id": "p_d2",
      "type": "PMOSDiode",
      "ports": {"node": "Np2", "vdd": "VDD"},
      "impl": {"char_ref": "lib.motifs/pmos_diode@1.0"}
    },
    {
      "id": "p_cas",
      "type": "PMOSCascodeElement",
      "ports": {"out": "vout", "gate": "vb4", "src": "Np2"},
      "impl": {"char_ref": "lib.motifs/pmos_cascode_element@1.0"}
    },
    {
      "id": "load_top",
      "type": "ActiveLoad",
      "traits": ["LoadDevice"],
      "ports": {"node": "NpBias", "bias": "vb5", "vref": "VDD"},
      "params": {"polarity": "PMOS"},
      "impl": {"char_ref": "lib.motifs/active_load@1.0"}
    },
    {
      "id": "n_up",
      "type": "NMOSCascode",
      "ports": {"in": "Nn", "out": "vout", "bias": "vb2", "gnd": "GND"},
      "impl": {"char_ref": "lib.motifs/nmos_cascode@1.0"}
    },
    {
      "id": "n_src",
      "type": "TailCurrentSourceNMOS",
      "ports": {"out": "Nn", "gate": "vb2", "gnd": "GND"},
      "impl": {"char_ref": "lib.motifs/tail_nmos@1.0"}
    },
    {
      "id": "Cload",
      "type": "Cap",
      "ports": {"p": "vout", "n": "GND"},
      "params": {"C": {"value": 1.0e-12, "unit": "F"}}
    }
  ],

  "constraints": {
    "numeric": [
      {"id": "c_gain", "kind": "ineq", "lhs": {"metric": "gain_db"}, "op": ">=", "rhs": {"value": 60, "unit": "dB"}, "scope": {"node": "vout"}}
    ],
    "tech": [{"id": "t_lmin", "kind": "limit", "on": "*", "rule": "L>=", "value": 1.8e-7, "unit": "m"}]
  },

  "harness": {
    "supplies": [{"net": "VDD", "value": 1.8, "unit": "V"}],
    "loads": [{"node": "vout", "C": 1.0e-12, "unit": "F"}],
    "sources": [{"bundle": "IN", "Z": 50.0, "unit": "Ohm"}],
    "pvt": {"corners": ["TT@27C"]}
  },

  "benches": ["AC_OpenLoop"],
  "provenance": {"sources": [{"file": "templates/ota/ota012/netlist.cas", "span": {"from": 1, "to": 19}}]}
}
