{
  "ir_version": 1,
  "format": "casir-json-1",
  "level": "EL",
  "meta": {"tool": "cascode-0.2.0", "when": "2025-10-09T00:00:00Z"},

  "nets": [
    {"id": "VDD",   "domain": "supply",    "rail": "VDD"},
    {"id": "GND",   "domain": "ground",    "rail": "GND"},
    {"id": "vinp",  "domain": "electrical"},
    {"id": "vinn",  "domain": "electrical"},
    {"id": "voutp", "domain": "electrical"},
    {"id": "voutn", "domain": "electrical"},
    {"id": "N001",  "domain": "electrical"},
    {"id": "N002",  "domain": "electrical"},
    {"id": "N003",  "domain": "electrical"},
    {"id": "N004",  "domain": "electrical"},
    {"id": "N005",  "domain": "electrical"},
    {"id": "vb1",   "domain": "bias"},
    {"id": "vb2",   "domain": "bias"},
    {"id": "vb3",   "domain": "bias"},
    {"id": "vb4",   "domain": "bias"},
    {"id": "vb5",   "domain": "bias"}
  ],

  "bundles": [
    {"id": "IN",  "type": "Diff", "fields": {"p": "vinp", "n": "vinn"}},
    {"id": "OUT", "type": "Diff", "fields": {"p": "voutp", "n": "voutn"}}
  ],

  "motifs": [
    {
      "id": "ptail",
      "type": "TailCurrentSourcePMOS",
      "ports": {"out": "N001", "gate": "vb1", "vdd": "VDD"},
      "impl": {"char_ref": "lib.motifs/tail_pmos@1.0"}
    },
    {
      "id": "dp",
      "type": "DiffPairPMOS",
      "traits": ["AmplifierStage"],
      "ports": {"in_p": "vinp", "in_n": "vinn", "tail": "N001", "vdd": "VDD"},
      "impl": {"char_ref": "lib.motifs/diff_pair_pmos@1.0"}
    },
    {
      "id": "load_p",
      "type": "ActiveLoad",
      "traits": ["LoadDevice"],
      "ports": {"node": "N002", "bias": "vb5", "vref": "VDD"},
      "params": {"polarity": "PMOS"},
      "impl": {"char_ref": "lib.motifs/active_load@1.0"}
    },
    {
      "id": "load_n",
      "type": "ActiveLoad",
      "traits": ["LoadDevice"],
      "ports": {"node": "N003", "bias": "vb5", "vref": "VDD"},
      "params": {"polarity": "PMOS"},
      "impl": {"char_ref": "lib.motifs/active_load@1.0"}
    },
    {
      "id": "p_cas_p",
      "type": "PMOSCascodeElement",
      "ports": {"out": "voutp", "gate": "vb4", "src": "N002"},
      "impl": {"char_ref": "lib.motifs/pmos_cascode_element@1.0"}
    },
    {
      "id": "p_cas_n",
      "type": "PMOSCascodeElement",
      "ports": {"out": "voutn", "gate": "vb4", "src": "N003"},
      "impl": {"char_ref": "lib.motifs/pmos_cascode_element@1.0"}
    },
    {
      "id": "n_src_p",
      "type": "TailCurrentSourceNMOS",
      "ports": {"out": "N005", "gate": "vb2", "gnd": "GND"},
      "impl": {"char_ref": "lib.motifs/tail_nmos@1.0"}
    },
    {
      "id": "n_cas_p",
      "type": "NMOSCascode",
      "ports": {"in": "N005", "out": "voutp", "bias": "vb3", "gnd": "GND"},
      "impl": {"char_ref": "lib.motifs/nmos_cascode@1.0"}
    },
    {
      "id": "n_src_n",
      "type": "TailCurrentSourceNMOS",
      "ports": {"out": "N004", "gate": "vb2", "gnd": "GND"},
      "impl": {"char_ref": "lib.motifs/tail_nmos@1.0"}
    },
    {
      "id": "n_cas_n",
      "type": "NMOSCascode",
      "ports": {"in": "N004", "out": "voutn", "bias": "vb3", "gnd": "GND"},
      "impl": {"char_ref": "lib.motifs/nmos_cascode@1.0"}
    },
    {
      "id": "Cload",
      "type": "Cap",
      "ports": {"p": "voutn", "n": "GND"},
      "params": {"C": {"value": 1.0e-12, "unit": "F"}}
    },
    {
      "id": "Cload1",
      "type": "Cap",
      "ports": {"p": "voutp", "n": "GND"},
      "params": {"C": {"value": 1.0e-12, "unit": "F"}}
    }
  ],

  "constraints": {
    "numeric": [
      {"id": "c_gain", "kind": "ineq", "lhs": {"metric": "gain_db"}, "op": ">=", "rhs": {"value": 60, "unit": "dB"}, "scope": {"node": "voutp"}}
    ],
    "tech": [{"id": "t_lmin", "kind": "limit", "on": "*", "rule": "L>=", "value": 1.8e-7, "unit": "m"}]
  },

  "harness": {
    "supplies": [{"net": "VDD", "value": 1.8, "unit": "V"}],
    "loads": [
      {"node": "voutp", "C": 1.0e-12, "unit": "F"},
      {"node": "voutn", "C": 1.0e-12, "unit": "F"}
    ],
    "sources": [{"bundle": "IN", "Z": 50.0, "unit": "Ohm"}],
    "pvt": {"corners": ["TT@27C"]}
  },

  "benches": ["AC_OpenLoop"],
  "provenance": {"sources": [{"file": "templates/ota/ota010/netlist.cas", "span": {"from": 1, "to": 35}}]}
}
